//1.Перевірити чи число знаходиться в діапазоні від 25 до 99 включно (25 і 99 входять в діапазон).
//Число ввести за допомогою prompt. Якщо відвідувач ввів число не з діапазону -попросити ввести
//ще раз, і так далі. Цикл повинен питати число поки відвідувач не введе число з діапазону, або не натисне кнопку Cancel (ESC).

let number = prompt("Введіть число в діапазоні від 25 до 99", "");

for (let i = 25; i <= 99; i++) {
  if (number == null) {
    console.log("ОТМЕНЕНО !!!!!");
    break;
  } else if (number < 25 || number >= 99) {
    console.log("Число не в діапазоні");
    number = prompt("Введіть число в діапазоні від 25 до 99", "");
  } else number == 25 || number <= 99;
  console.log("Число знаходиться в діапазоні");
}
